[
    {
        "date": "2024-10-06",
        "sessionNumber": 1,
        "details": "K and Pyrrha found their way to the town of Kamtor, where they encountered and spoke with the large orc innkeeper and seeming leader of the town, Gale, who told Pyrrha about the undead presences that have been showing up along the border of the nearby Nahir forest. After finishing up a previous job, Xavier found their way to the same inn, however any relaxing evening was interrupted by an undead attack on the town, which was fended off by K, Xavier, Pyrrha, and the town guard, but not without losses. Further investigation on the seeming leader of the attack, a faceless undead, yeilded a silver coin found on its person, an insignia of the Church of Death from the city of Riverseed on its face. Before heading back, Pyrrha noticed a cloaked figure on the edge of the woods, with red eyes shinning against the black backdrop. After a nights rest, the three found Gale attempting to calm down an agitate crowd, seeking answers and safety. After Xavier offered to venture into the woods to find the root of the undead issue, Pyrrha and K volunteered to go with, and upon collecting some supplies ventured off, making their way into the woods. Encountering a seeming scout of this presence and following in its direction of travel, and almost dying crossing a river, the three set up camp 20ish miles south of a large fog cloud covering a large swath of the the woods. K taking the first watch was distracted, and thus did not notice the 3 faceless ones that descended on the camp. However, Pyrrhas senses noticed just before they attacked Xavier, unleashing a turn undead and sending one of them running, leaving two left standing over the party."
    },
    {
        "date": "2024-10-20",
        "sessionNumber": 2,
        "details": "The party woke up with a start, being attacked by a few wights, which they managed to fight off but had to flee when reinforcements arrived. They fled and hid within the woods, realizing some new truths about each other, and after a moderately tense discussion, Kaia divulged their true identity, mentioning an ancient people known as the Seraphids. Upon coming to an understanding, they ventured towards the fog cloud, entering it following small lights that seemed to float in the mist. Upon entering the mist, they were surrounded by more of these lights, which led them away towards the north of the fog cloud, at which time they attempted to kill the party by leading them off a cliff, however, the party successfully fended them off by Pyrrha’s clerical proficiency combined with Xavier’s telepathic abilities. After fighting them off, the party stealthily made their way towards the central ruins, following the black veins in the ground and avoiding the prowling undead in the fog. The party made their way to the tower at the center of it all, seeing red light emitting from the top of the tower and a rickety drawbridge leading to it across a moat of black ichor."
    },
    {
        "date": "2024-10-28",
        "sessionNumber": 3,
        "details": "The party made their way into the tower at the center of the fog cloud, sneaking in and utilizing a screaming rock as a distraction. After some difficulty with an iron door, they entered and made their way up the tower and found a laboratory with a female tiefling inside, and after a very brief conversation fought her, eventually leading her to attempt to escape through her patron, to whom she referred to as Auntie Annie, at which point she was crushed into a gold coin she was carrying. The party found a variety of items, including a tiny scythe called a Death Scythe, which communicated with Pyrrha after attunement, asking her to return the scythe to Anntie Annie near Atharnac. The party returned to Kamtor, seeing the undead presence diminished within the woods, their task completed, and discussed next steps, deciding to stick together in shared interest and curiosity. As they arrived, the town under siege from a group of raiders, whom the party helped fend off and deal with the fire they set to the crops. The party enjoyed a relatively calm evening, had fun, and slept in free rooms at the Frothy Tankard Inn."
    },
    {
        "date": "2024-11-11",
        "sessionNumber": 4,
        "details": "The party left Kamtor searching for answers to their recent encounter with Cynthia, the necromancer in the Nahir Woods, making their way to Riverseed aboard a shipping vessel and staying at The Nut Inn upon arrival. Later, the party all went to visit the House of Breath, and after speaking to some of the breath keepers there were pointed in the direction of the temple of death here in Riverseed. Meeting with Doomguide Haven, they had a tense discussion and learned about the previous peoples of the temple and the root of the coins the party had found. Further, Kaia made a request to help a friend trapped in her journal, and in exchange gave Haven information about her people, the Seraguine, immortal remnants of the ancient Seraphid people. Haven agreed to help with the blessing of a body to transfer the souls into it, however she said that Kaia must find her the body to be used in the ritual with a very specific set of parameters for a viable body. After this discussion, they went shopping, and met a few interesting characters while purchasing a crowbar and bartered for other magical items. Later, Pyrrha attuned to the scythe that she had found in Cynthia’s possession, communing with Auntie Annie in an attempt to learn more about this mysterious figure. However, after learning very little, Pyrrha attempted to unattune the item, quickly learning that this time Auntie wasn’t letting her off that easy."
    },
    {
        "date": "2024-11-18",
        "sessionNumber": 5,
        "details": "After Pyrrha threatened Auntie Annie being unable to unattune the scythe, the party began by doing some additional research, seeking out information on where they were headed next, deciding to go towards the front to find answers to the root of Cynthia’s power. On the way, they began to notice more indications of war in the republic headed towards the western front lines of the decade long civil war. Along the journey they met a manner of interesting folk, including a band of children who attempted to rob the party unsuccessfully. However, each night on the road Pyrrha noticed a strange cart showing up at the same time each night, pulled by a brown horse and driven by a cloaked figure carrying a lantern, the cart was covered by a brown tarp. After finding a hand that fell out of the cart, the party ambushed the cart to learn what was going on, finding the driver to be nothing but a cloak, and the cart to be filled with body parts, some skeletal remains, most human, and some animal."
    },
    {
        "date": "2024-11-25",
        "sessionNumber": 6,
        "details": "The party made it to the front line of the conflict between the Torgatine Empire and the Eventrope Republic, witnessing the devastation that the empire brings in warfare. Using Pyrrhas status as a Breathkeeper as a mode of entry into the military encampment, the party went to meet with General Vivian, having some time to kill before the meeting Kaia went about speaking to the smiths in the area and was told to see Head Forger Nadar to perhaps use her talents for the good of the Republic. Pyrrha also noticed 3 figures appear along the coastline before quickly moving away, one headed south, one north, and one directly towards the camp. The party then spoke with General Vivian, who told them that Velgorath had been taken recently by the empire and couldn’t promise passage to the Empire's mainland, but was willing to help as she could with the mission to Atharnac. After passing on that there may be an incursion into the camp and the bodies being brought along the path, the party began helping out where they could, speaking with Dr. Frygg, an automaton doctor who had Pyrrha help with the most wounded while Kaia helped brew healing elixirs for patients. Just as they were finishing up, Xavier was attack by one of the cloaked figures, attempting to take him with them to a man named Gorvan Hollow, which was foiled. However, they said they would be back and escaped into the night, and Vivian appointed guards to watch over the party as they slept, now being people on interest not just to the Empire, but to the Republic as well."
    },
    {
        "date": "2024-12-02",
        "sessionNumber": 7,
        "details": "After being attacked the night before, the party went on individual missions during the day in preparation for leaving for Atharnac. Xavier and Pyrrha went to speak with General Vivian, during which time they also spoke in more depth with Dr. Frygg. Frygg seemed interested in Xavier’s condition and the reason Gorvan Hollow was after him, where Xavier revealed he has a crystal in his head. Frygg examined Xavier and told him that the crystal was made up of a substance called Astron, a powerful magical essence with the power to give Xavier his powers and Frygg his sentience. Xavier and Pyrrha then discussed the plan with General Vivian, confirming to leave the following day on the Rising Dawn before going about gathering intel and some materials. Kaia went to speak with Head Forger Nadar, who excitedly worked with Kaia during the entire day to help her learn to forge and make modifications to her armor, offering Kaia an apprenticeship for when she was ready. The party then gathered together, rested well, and left on the Rising Dawn the next day, meeting the group accompanying them on their journey, including Sagard, a wizard who Xavier had met earlier the previous day. The party and the crew began the journey, making good time before a storm arrived, during which time they were attacked by water elementals."
    },
    {
        "date": "2025-01-06",
        "sessionNumber": 8,
        "details": "The party made their way towards Atharnac and the coast of the Dead Forest upon the Rising Dawn, finding yourself in the middle of a magically enhanced storm and through a group effort were able to quell the storm and escape, mending the ship and helping the crew drive the vessel to safety. After a few days, they arrived on the coast of the Dead Forest, noticing that the area has a strange magical essence in the ground and surrounding area, a dusting of Astron covering everything. The party and their new companions trekked towards Atharnac, finding only a mile large crater in the ground where the city once stood, the hut of Auntie Annie located in the middle of a legion of imperial forces. Without time to plan as after being discovered by one of Annie's abominations, the party was escorted to the hut meeting Annie in all her horror, entering and quickly deciding to end this foe. The battle was tough, losing both Sagard and Wymar to the fight and dropping Pyrrha while Landlyn held the door against the legion outside, but in the end the party was successful in killing the death hag. After searching around they found a collection of items, taking some time after the battle to rest."
    },
    {
        "date": "2025-01-13",
        "sessionNumber": 9,
        "details": "The party recovered from their battle with Auntie Annie, sleeping in the hut and heading out the following day to find that when they returned to the bank where they left their ship only to find wreckage and the remains of captain Pleasance. Looking for answers, they noticed a tent on the bank and found Drayden, a veteran fighter from the empire. Upon further investigation, they learned he was running from the empire and that the ship was likely destroyed by Annie before she was vanquished, and learned that Wymar, Landlyn and Sagard were part of a secondary mission to Darsentine, the Empires capital. Landlyn left to go complete his mission while the party, now with a new acquaintance, ventured south around the long end of the continent making their way back to the Republic. Encountering some imperial forces along the way, the party escaped by water, running all the way to the Republics bank with Pyrrha casting water walk the entire way. Exhausted, the party began recovering before meeting with General Vivian the following day, giving Sagards body to the people of Sailon’s Harbor."
    },
    {
        "date": "2025-01-20 (Next Session)",
        "sessionNumber": 10,
        "details": ""
    }
    
]
