{
    "Organizations": {
        "Torgatine Empire": {
            "description": "The Torgatine Empire is a militaristic nation. It has survived several major conflicts, most recently fighting a civil war agaisnt the Eventrope Republic. The capital, Darsentine, is ruled over by Emperess Kor and the Consular Assembly. Magic is strictly controlled within the borders of the empire, each person required to register their magical abilities, reserving the power for only the elite. During civil war, the empire utlizied a powerful Astron bomb on the city of Atharnac, destroying everything in the area and puncturing the weave in the process. More recently, they seem to have employed the help of Auntie Annie in recruiting forces of undead to take Velgorath and attack the Republic.",
            "image": "Images/Torgatine Empire Emblem.webp"
        },
        "Eventrope Republic": {
            "description": ""
        }
    },
    "People": {
        "Gorvan Hallow": {
            "description": ""
        }
    },
    "Places": {
        "Atharnac": {
            "description": ""
        },
        "Dead Forest": {
            "description": ""
        },
        "Velgorath": {
            "description": ""
        },
        "Darsentine": {
            "description": "Capital of the Torgatine Empire, situated on a volcano from which Astron is mined."
        }
    },
    "Substances": {
        "Astron": {
            "description": "A powerful, extra-planar blue substance utilized by the Torgatine Empire for both experimentation and destruction. A crystal of Astron was inplanted in Xaviers head to give him abilities and was also used to give Dr. Frygg his sentience. Astron was also used in a bomb used to destroy Atharnac.",
            "image": "Images/Astron.webp"
        },
        "Ash": {
            "description": "A powder used in the imbueing of magical items and artifacts."
        }
    },
    "Gods": {
        "Kelemvor": {
            "description": ""
        },
        "Lathander": {
            "description": ""
        }
    }
}
