{
    "Organizations": {
        "Torgatine Empire": {
            "description": "The Torgatine Empire is a militaristic nation that has survived several major conflicts, most recently fighting a civil war against the Eventrope Republic. The capital, Darsentine, is ruled over by Emperess Kor and the Consular Assembly. Magic is strictly controlled within the borders of the empire, each person required to register their magical abilities, reserving the power for only the elite. During the ongoing civil war, the empire utlizied a powerful Astron bomb on the city of Atharnac, destroying everything in the area and puncturing the Weave in the process. More recently, they seem to have employed the help of Auntie Annie in recruiting forces of undead to take Velgorath and attack the Republic, recently thwarted by the party.",
            "image": "Images/Torgatine Empire Emblem.webp"
        },
        "Eventrope Republic": {
            "description": "A coalition of regions that split off from the Torgatine Empire’s domination, the Eventrope Republic is diverse in population, religions, and magical practices. Unlike the Empire, the Republic is a democracy ruled by the elected Congress of Sovereigns. The Republic has been fighting the Empire for their independence for a decade, using their abundant natural resources, diverse military styles from the varying regions, and strong naval presence to their advantage. However, they recently lost the city of Velgorath to the Empire’s combination of military and undead forces. While the Elven Nellnor’yl Clans have sided with the Republic in the Civil War, they have not provided much reasoning for their decision and the Republic is in no position to question their allies.",
            "image": "Images/Republic.webp"
        },
        "Nellnor’yl Clans": {
            "description": "A group of elven peoples separated into the Zarvathen (Drow), Siv’raelin (Aquatic), Feyr’alyn (Wood), and Thalor’nor (High) elven sects. Little is known about the clans due to their secretive nature, however they have sided and aided the Eventrope Republic in their effort to separate from the Torgatine Empire."
        }
    },
    "People": {
        "Gorvan Hallow": {
            "description": "An imperial scientist working for the Torgatine Empire who has been described as a deeply troubled man. He experimented on Xavier and is responsible for the Astron implanted in his head. He has also sent magical operatives to retrieve Xavier. He also worked on Drayden, giving him his abilities as a first generation Imbueri."
        },
        "General Vivian": {
            "description": "Leader of the Windhaven forces for the Eventrope Republic in the ongoing Imperial Civil War, gave reinforcements to the party for their quest to destroy Auntie Annie."
        },
        "Dr. Frygg": {
            "description": "A medically trained sentient automaton originating from the Torgatine Empire, Now working with General Vivian and the Eventrope Republic in the conflict. Dr. Frygg has shown keen interest in Xaviers condition, himself carrying an Astron crystal in his head that gave him sentience."
        },
        "Doomguide Haven": {
            "description": "Leader of the Chruch of the Dead in Riverseed, follower of Kelemvor. Has taken the information about the Seraguine from Kaia and has begun a crusade to eliminate the undead presence in the Wastes of Serath."
        },
        "Auntie Annie": {
            "description": "(Deceased) A death hag that took up residence in the crater of Atharnac, foiled and killed by the party as she was raising and undead army that appears to have been working with the Torgatine Empire."
        },
        "Imbueri": {
            "description": "A secret group of special forces from the empire, infused with Astron giving them incerdible speed and echo abilities, created by Gorvan Hallow. Have been implicated in the assassination of Sovereign Amada Botar and the kidnap of Xavier from the party."
        },
        "Korashak": {
            "description": "One of the 5 elders of the seraguine people, chased down Kaia and fought the party and Doomguide Haven in the ruins of Khal,Sinar before fleeing after losing the fight."
        }
    },
    "Places": {
        "Atharnac": {
            "description": "(Destroyed) During the civil war, the Torgatine Empire responded to conflict in the city of Atharnac with a devastating Astron bomb, the destruction of which seemingly surprised even them. All that remains of the city is a mile-wide crater where Auntie Annie had set up her hut and undead army."
        },
        "Dead Forest": {
            "description": "The area of the Torgatine Empire land that was obliterated by the Empire’s Astron bomb, including the city of Atharnac. The land is covered in a dusting of blue Astron and no life grows here, nor does anything decay. The bomb tore the Weave in the Dead Forest, rendering magic uncontrollably wild and disrupting divine power."
        },
        "Velgorath": {
            "description": "A southern city that once belonged to the Eventrope Republic, the Torgatine Empire overtook Velgorath six months ago with the use of undead forces."
        },
        "Khal'Sinar": {
            "description": "An ancient temple of the Seraphid Dominion that contains a ritual pool only accessible through trials for cleansing of the soul. The party encountered Korashak here on their mission to recover Doomguide Haven."
        },
        "Darsentine": {
            "description": "Capital of the Torgatine Empire, situated on a volcano from which Astron is mined."
        },
        "Riverseed": {
            "description": "A dominant member of the Eventrope Republic, overseen by Sovereign Amada Botar, who was assassinated recently by an Imbueri. The city is a large port of much of the inner Republic goods to flow out by river, and is also home to the Church of the Dead to Kelemvor, built on the remenants of an old cult of Shar."
        },
        "Sailons Harbor": {
            "description": "A dominant member of the Eventrope Republic, overseen by High Captain Paisy Dunborn."
        }
    },
    "Substances": {
        "Astron": {
            "description": "A powerful, extra-planar blue substance utilized by the Torgatine Empire for both experimentation and destruction. A crystal of Astron was inplanted in Xaviers head to give him abilities and was also used to give Dr. Frygg his sentience. Astron was also used in a bomb used to destroy Atharnac."
        },
        "Ash": {
            "description": "A powder used in the imbueing of magical items and artifacts."
        }
    },
    "Gods": {
        "Kelemvor": {
            "description": "God of the Dead and Judge of the Damned, followers of Kelemvor understand that death is not something to fear but is a natural part of life. Known for maintaining the balance between life and death, Kelemvor opposes undeath in all forms. He was one of the three deities worshipped by the fallen Seraphid Dominion."
        },
        "Lathander": {
            "description": "God of birth and renewal, Lathander’s domain is depicted with flowers, flowing water, and sunbursts. Followers of Lathander are often optimistic and headstrong. He was one of the three deities worshipped by the fallen Seraphid Dominion."
        },
        "Savras": {
            "description": "God of fate and knowledge, Savras is often depicted with orbs of divination and eyes of fate. He was one of the three deities worshipped by the fallen Seraphid Dominion."
        },
        "Shar": {
            "description": "Goddess of darkness and loss, Shar is often depected by a empty black cloak. The goddess, like Kelemvor, occupies the domain of death, however is partial to undeath as a tool and is seen as one of the evil gods."
        }
    }
}
